app/views/user_books/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>User:</strong>
  <%= User.where(id: @user_book.user_id).last.username %>

SELECT "books".* FROM "books" WHERE "books"."id" = $1 ORDER BY "books"."id" DESC LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  <strong>Book:</strong>
  <%= Book.where(id: @user_book.book_id).last.title %>