app/controllers/books_controller.rb

  def create
    @book = Book.new(book_params)
    respond_to do |format|
      if @book.save
---
INSERT INTO "books" ("title", "created_at", "updated_at", "author", "published_date", "price") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["title", "1111"], ["created_at", "2022-09-16 05:38:49.347985"], ["updated_at", "2022-09-16 05:38:49.347985"], ["author", "a"], ["published_date", "2022-01-01"], ["price", 10.0]]

  def update
    respond_to do |format|
      if @book.update(book_params)
---
UPDATE "books" SET "updated_at" = $1, "author" = $2 WHERE "books"."id" = $3  [["updated_at", "2022-09-16 03:02:29.650061"], ["author", "bbbbb"], ["id", 7]]